[
  {
    "_id": "648230d33908a38ab7e74b6b",
    "salary": "120k - 150k",
    "company_logo": "https://www.freepnglogos.com/uploads/google-logo-png/file-google-logo-svg-wikimedia-commons-23.png",
    "experience": "3 - 5 years",
    "job_title": "Senior Software Engineer",
    "job_type": "full time",
    "job_location": "onsite",
    "company_name": "Google LLC",
    "education_requirement": "Bachelor degree in CSE from any reputed university",
    "email": "hinesvang@google.com",
    "phone": "+1 (820) 530-2716",
    "location": "Nicholson, Kentucky",
    "job_description": "A Senior Software Engineer plays a pivotal role in designing, developing, and maintaining complex software systems. They are responsible for leading the implementation of software projects, collaborating with cross-functional teams to translate business requirements into technical solutions, and ensuring the delivery of high-quality and scalable software solutions.",
    "job_responsibility": "As a Senior Software Engineer, your job responsibilities will include leading the design and implementation of software applications and features. You will be responsible for writing clean, efficient, and maintainable code that meets project requirements. Conducting code reviews and providing constructive feedback to junior developers will be essential in ensuring code quality and fostering a collaborative development environment.",
    "address": " 1600 Amphitheatre Parkway in Mountain View, California"
  },
  {
    "_id": "648230d3cb4700c4fa77fcee",
    "salary": "120k - 150k",
    "company_logo": "https://www.freepnglogos.com/uploads/amazon-png-logo-vector/woodland-gardening-amazon-png-logo-vector-8.png",
    "experience": "2 - 3 years",
    "job_title": "Data Scientist",
    "job_type": "full time",
    "job_location": "remote",
    "company_name": "Amazon",
    "education_requirement": "Bachelor degree in CSE from any reputed university",
    "email": "gloriabates@amazon.com",
    "phone": "+1 (830) 431-3440",
    "location": "Vivian, Georgia",
    "job_description": "A Data Scientist is a key role in the field of data analytics and decision-making. As a Data Scientist, you will be responsible for analyzing complex data sets, developing statistical models, and deriving actionable insights. You will work closely with cross-functional teams to identify business challenges, formulate data-driven solutions, and communicate findings to stakeholders.",
    "job_responsibility": "As a Data Scientist, your job responsibilities will encompass collecting, cleaning, and preprocessing large and complex datasets to extract valuable insights. Applying statistical analysis and machine learning techniques, you will develop predictive models and conduct hypothesis testing to derive actionable conclusions. Collaborating with business analysts and domain experts, you will define project objectives and design data-driven solutions to address business challenges.",
    "address": " 1600 Amphitheatre Parkway in Mountain View, California"
  },
  {
    "_id": "648230d304a42f6fc6cb72b4",
    "salary": "120k - 150k",
    "company_logo": "https://www.freepnglogos.com/uploads/netflix-logo-0.png",
    "experience": "3 - 4 years",
    "job_title": "UX/UI Designer",
    "job_type": "full time",
    "job_location": "onsite",
    "company_name": "Netflix",
    "education_requirement": "Bachelor degree in CSE from any reputed university",
    "email": "mortonwalter@netflix.com",
    "phone": "+1 (802) 479-3709",
    "location": "Alfarata, Arizona",
    "job_description": "A UX/UI Designer is a critical role responsible for creating intuitive and visually appealing user interfaces for digital products. As a UX/UI Designer, you will collaborate closely with product managers, developers, and stakeholders to understand user requirements and design seamless user experiences. Your expertise in user research, information architecture, and visual design will be instrumental in delivering user-centric designs that enhance user satisfaction and engagement.",
    "job_responsibility": "As a UX/UI Designer, your job responsibilities encompass a range of tasks aimed at creating intuitive and visually appealing user interfaces for digital products. You will conduct user research and gather user requirements to gain deep insights into user behaviors, needs, and preferences. Using this information, you will create wireframes, prototypes, and interactive designs that effectively address user pain points and improve user experiences.",
    "address": " 1600 Amphitheatre Parkway in Mountain View, California"
  },
  {
    "_id": "648230d36c0507f872a6cbed",
    "salary": "120k - 150k",
    "company_logo": "https://www.freeiconspng.com/uploads/facebook-text-logo-transparent-10.png",
    "experience": "3 - 5 years",
    "job_title": "Product Manager",
    "job_type": "full time",
    "job_location": "onsite",
    "company_name": "Facebook",
    "education_requirement": "Bachelor degree in CSE from any reputed university",
    "email": "inezwolf@facebook.com",
    "phone": "+1 (809) 500-2544",
    "location": "Austinburg, New Hampshire",
    "job_description": "A Product Manager is a key role in the development and success of a product or product line. As a Product Manager, you will be responsible for the strategy, roadmap, and execution of the product throughout its lifecycle. You will collaborate closely with cross-functional teams, including engineering, design, marketing, and sales, to define product requirements, prioritize features, and deliver a compelling product that meets customer needs and business objectives.",
    "job_responsibility": "As a Product Manager, your job responsibilities will involve overseeing the strategy, development, and success of a product or product line. You will collaborate closely with cross-functional teams, including engineering, design, marketing, and sales, to define and prioritize product requirements, features, and functionalitie",
    "address": " 1600 Amphitheatre Parkway in Mountain View, California"
  },
  {
    "_id": "648230d37c506e36ea528392",
    "salary": "120k - 150k",
    "company_logo": "https://www.freepnglogos.com/uploads/tesla-logo-png-20.png",
    "experience": "1 - 2 years",
    "job_title": "Machine Learning Engineer",
    "job_type": "full time",
    "job_location": "remote",
    "company_name": "Tesla",
    "education_requirement": "Bachelor degree in CSE from any reputed university",
    "email": "hoodramirez@tesla.com",
    "phone": "+1 (804) 459-3711",
    "location": "Dowling, Mississippi",
    "job_description": "A Machine Learning Engineer is a skilled professional responsible for designing, developing, and implementing machine learning algorithms and models. As a Machine Learning Engineer, you will work closely with data scientists, software engineers, and domain experts to build robust and scalable machine learning solutions that address complex business problems.",
    "job_responsibility": "As a Machine Learning Engineer, your responsibilities encompass the entire lifecycle of developing and implementing machine learning solutions. This includes collecting, cleaning, and preprocessing data, as well as designing and training machine learning models. You will work closely with data scientists and domain experts to validate and evaluate the models using real-world data. Integrating the models into production systems and ensuring scalability and efficiency are vital aspects of your role.",
    "address": " 1600 Amphitheatre Parkway in Mountain View, California"
  },
  {
    "_id": "648230d3e920be80aa74f69e",
    "salary": "120k - 150k",
    "company_logo": "https://www.freepnglogos.com/uploads/google-logo-png/file-google-logo-svg-wikimedia-commons-23.png",
    "experience": "4 - 5 years",
    "job_title": "Cybersecurity Engineer",
    "job_type": "full time",
    "job_location": "onsite",
    "company_name": "Google LLC",
    "email": "kennedyruiz@google.com",
    "education_requirement": "Bachelor degree in CSE from any reputed university",
    "phone": "+1 (827) 494-2540",
    "location": "Blanco, Missouri",
    "job_description": "A Cybersecurity Engineer is a highly skilled professional responsible for protecting computer systems, networks, and data from unauthorized access, breaches, and threats. As a Cybersecurity Engineer, you will play a critical role in implementing and maintaining security measures to safeguard sensitive information and ensure the confidentiality, integrity, and availability of systems and data.",
    "job_responsibility": "As a Cybersecurity Engineer, your primary responsibility is to protect computer systems, networks, and data from potential threats and unauthorized access. This includes conducting risk assessments and vulnerability testing to identify weaknesses in systems and infrastructure.",
    "address": " 1600 Amphitheatre Parkway in Mountain View, California"
  }
]
